using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ForTest.Darts
{
    internal class darts
    {
        public static int Score(double x, double y)
        {
            int res = 0;

            int InCircle = (x <=5 && y >=-5) || (x >=-5 && y <=5) ? res += 10 :res+=0;

            int MiddleCircle = (x < 10 && y > -10) || (x > -10 && y < 10) ? res += 5 : res += 0;

            int OutCircle = (x > 10 || y < -10)||(x<-10 ||y>10)? res+=0 : res+=0 ;

            return res;
        }
    }


    /*инструкции
Напишите функцию, которая возвращает очки, заработанные за один бросок в игре в дартс.

Дартс — игра, в которой игроки бросают дротики в цель .

В нашем конкретном случае игры цель приносит 4 разных количества очков, в зависимости от того, куда приземлится дротик:

Если дротик попадает за пределы цели, игрок не получает очков (0 очков).
Если дротик попадает во внешний круг мишени, игрок получает 1 очко.
Если дротик попадает в средний круг мишени, игрок получает 5 очков.
Если дротик попадает во внутренний круг мишени, игрок получает 10 очков.
Внешний круг имеет радиус 10 единиц (это эквивалентно общему радиусу всей цели), средний круг — радиус 5 единиц, а внутренний круг — радиус 1. Конечно, все они центрированы в точке одна и та же точка — то есть круги концентричны , определяются координатами (0, 0).

Напишите функцию , которая, учитывая точку в цели (определяемую ее декартовыми координатами x и y, где xи yдействительные ), возвращает правильную сумму, заработанную при приземлении дротика в эту точку.

Как отладить
     */
}
